[
    {
        "name": "Shubble",
        "source": "Rensselaer Center for Open Source",
        "start": "4/25",
        "end": "NOW",
        "goal": "",
        "details": "",
        "images": ["shubble.png"],
        "tags": [],
        "more": [["GitHub", "https://github.com/wtg/shubble"], ["Site", "https://staging-web-shuttles.rpi.edu/"]]
    },
    {
        "name": "Robot Leader-Follower Control",
        "source": "RPI ECSE Department, School of Engineering",
        "start": "1/24",
        "end": "5/24",
        "goal": "",
        "details": "",
        "images": ["robot-arm.png"],
        "tags": [],
        "more": []
    },
    {
		"name" : "MinSeg Arduino Kit",
        "source": "RPI Cognitive Science Department, School of HASS",
        "start" : "1/24",
        "end" : "12/24",
        "goal" : "Develop kits and resources for students to pursue the Wumpus Challenge!",
        "details" : "A professor from the Philosophy department was using LEGO Mindstorms for his Wumpus Challenge project, but Mindstorms was discontinued in 2022. After my partner and I solved the Wumpus Challenge using an Arduino (see project in 2023), the professor asked us to develop a kit to enable students to tackle the Wumpus challenge. I had taken a Mechatronics course with another professor in the Engineering department, who made Arduino kits for his course. I led 2 other students in designing a kit with the Electrical Engineering professor which would meet the needs of the Philosophy professor. We made changes to our previous solution to the Wumpus challenge (2023) by designing a Printed Circuit Board (PCB) for the infrared sensors, adding screw holes for the ball caster wheel in front, and rerouting pins to avoid external wiring. This project involved some soldering, Printed Circuit Board design, and the hardware and software of Arduino microcontrollers. After several iterations, we made a successful design which students will use in the Fall 2024 semester.",
        "images" : ["minseg_topview.jpeg", "minseg_parts.jpeg", "minseg_wheels.jpeg"],
        "tags" : [],
        "more" : [["GitHub", "https://github.com/Bram-Hub/NanoNav"], ["Docs", "https://bram-hub.github.io/NanoNav/"]]
	}
]
